Tekla Open API Reference for Tekla Structures 2025
DrawingHandler.GetDrawingSelector Method
 Gets a drawing selector. With a drawing selector the list of selected drawings can be gotten.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingSelector GetDrawingSelector()
Public Function GetDrawingSelector As DrawingSelector
Return Value
Type: DrawingSelector
The drawing selector.
See Also
Reference
DrawingHandler Class
Tekla.Structures.Drawing Namespace